# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2025-09-05 19:09:19 krylon>
#+TAGS: internals(i) ui(u) bug(b) feature(f)
#+TAGS: database(d) design(e), meditation(m)
#+TAGS: optimize(o) refactor(r) cleanup(c)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p) | SUSPENDED(s)
#+PRIORITIES: A G D

* Care Bear [27/31]
  :PROPERTIES:
  :COOKIE_DATA: todo recursive
  :VISIBILITY: children
  :END:
** Clocktable
   #+BEGIN: clocktable :scope file :maxlevel 255 :emphasize t
   #+CAPTION: Clock summary at [2025-09-05 Fr 19:09]
   | Headline                                        | Time       |            |          |      |      |      |
   |-------------------------------------------------+------------+------------+----------+------+------+------|
   | *Total time*                                    | *4d 22:28* |            |          |      |      |      |
   |-------------------------------------------------+------------+------------+----------+------+------+------|
   | *Care Bear [27/31]*                             | *4d 22:28* |            |          |      |      |      |
   | \_  /Components [26/30]/                        |            | /4d 21:36/ |          |      |      |      |
   | \_    Common [3/3]                              |            |            |     0:27 |      |      |      |
   | \_      Make default log level configurable     |            |            |          | 0:06 |      |      |
   | \_      Make all log levels configurable        |            |            |          | 0:15 |      |      |
   | \_      Prettify / Justify output of Logger     |            |            |          | 0:06 |      |      |
   | \_    Model [1/1]                               |            |            |     0:40 |      |      |      |
   | \_      Test IP enumeration                     |            |            |          | 0:28 |      |      |
   | \_    Database [2/2]                            |            |            |     7:32 |      |      |      |
   | \_      Extend schema                           |            |            |          | 2:10 |      |      |
   | \_      Make connection pool global             |            |            |          | 0:41 |      |      |
   | \_    Scanner [4/4]                             |            |            |    15:51 |      |      |      |
   | \_      Add a way to scan a specific network    |            |            |          | 0:53 |      |      |
   | \_      Make progress of scan more visible      |            |            |          | 1:28 |      |      |
   | \_      Make number of workers configurable     |            |            |          | 0:24 |      |      |
   | \_      Detect new devices?                     |            |            |          | 2:00 |      |      |
   | \_    Probe [9/13]                              |            |            |    16:03 |      |      |      |
   | \_      Implement commands [7/10]               |            |            |          | 5:31 |      |      |
   | \_        Available updates [6/6]               |            |            |          |      | 5:31 |      |
   | \_          Debian                              |            |            |          |      |      | 0:18 |
   | \_          openSUSE                            |            |            |          |      |      | 0:53 |
   | \_          FreeBSD                             |            |            |          |      |      | 0:29 |
   | \_          OpenBSD                             |            |            |          |      |      | 0:19 |
   | \_          Arch                                |            |            |          |      |      | 0:49 |
   | \_    Scheduler [1/1]                           |            |            | 2d 10:13 |      |      |      |
   | \_      Ping Device before probing              |            |            |          | 2:17 |      |      |
   | \_    Settings [2/2]                            |            |            |     5:34 |      |      |      |
   | \_      Integrate Settings into other packages  |            |            |          | 4:54 |      |      |
   | \_        Interval for querying pending updates |            |            |          |      | 3:57 |      |
   | \_    Web UI [4/4]                              |            |            |    13:16 |      |      |      |
   | \_      Display more activity in web interface  |            |            |          | 1:22 |      |      |
   | \_      Add summary to <details>                |            |            |          | 0:01 |      |      |
   | \_      Highlight Devices that are online       |            |            |          | 0:46 |      |      |
   | \_      Present sysload info and updates in UI  |            |            |          | 0:46 |      |      |
   | \_      Display pending updates                 |            |            |          | 1:22 |      |      |
   | \_  /Bugs [1/1]/                                |            | /0:52/     |          |      |      |      |
   | \_    Make scanner skip broadcast address...    |            |            |     0:52 |      |      |      |
   #+END:
** Components [26/30]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** Common [3/3]
**** DONE [#G] Make default log level configurable
     CLOSED: [2025-08-18 Mo 19:38]
     :LOGBOOK:
     CLOCK: [2025-08-01 Fr 15:46]--[2025-08-01 Fr 15:52] =>  0:06
     :END:
**** DONE Make all log levels configurable
     CLOSED: [2025-08-19 Di 18:02]
     :LOGBOOK:
     CLOCK: [2025-08-19 Di 17:47]--[2025-08-19 Di 18:02] =>  0:15
     :END:
**** DONE Prettify / Justify output of Logger
     CLOSED: [2025-08-22 Fr 19:39]
     :LOGBOOK:
     CLOCK: [2025-08-20 Mi 19:09]--[2025-08-20 Mi 19:15] =>  0:06
     :END:
*** Model [1/1]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-08-01 Fr 16:17]--[2025-08-01 Fr 16:29] =>  0:12
    CLOCK: [2025-07-11 Fr 14:50]--[2025-07-11 Fr 14:50] =>  0:00
    :END:
**** DONE Test IP enumeration
     CLOSED: [2025-07-11 Fr 15:18]
     :LOGBOOK:
     CLOCK: [2025-07-11 Fr 14:50]--[2025-07-11 Fr 15:18] =>  0:28
     :END:
*** Database [2/2]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-08-02 Sa 15:57]--[2025-08-02 Sa 16:45] =>  0:48
    CLOCK: [2025-07-08 Di 18:42]--[2025-07-08 Di 19:51] =>  1:09
    CLOCK: [2025-07-07 Mo 14:49]--[2025-07-07 Mo 16:08] =>  1:19
    CLOCK: [2025-07-07 Mo 14:40]--[2025-07-07 Mo 14:48] =>  0:08
    CLOCK: [2025-07-05 Sa 14:48]--[2025-07-05 Sa 15:44] =>  0:56
    CLOCK: [2025-07-04 Fr 14:54]--[2025-07-04 Fr 15:15] =>  0:21
    :END:
**** Extend schema
     :LOGBOOK:
     CLOCK: [2025-08-06 Mi 17:28]--[2025-08-06 Mi 18:19] =>  0:51
     CLOCK: [2025-08-05 Di 19:06]--[2025-08-05 Di 19:37] =>  0:31
     CLOCK: [2025-07-30 Mi 18:31]--[2025-07-30 Mi 19:19] =>  0:48
     :END:
     Right now ([2025-07-30 Mi]), the database only stores networks and
     devices, I obviously want to store more than that. Let's get to it.
**** CANCELLED More verbose logging
     CLOSED: [2025-08-16 Sa 22:09]
     This was a misguided idea from the start.
**** DONE Make connection pool global                    :internals:optimize:
     CLOSED: [2025-08-16 Sa 20:48]
     :LOGBOOK:
     CLOCK: [2025-08-16 Sa 20:07]--[2025-08-16 Sa 20:48] =>  0:41
     :END:
     The log file reveals lots of connections being opened, probably (my gut
     feeling says) more than are really needed.
*** Scanner [4/4]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-09-04 Do 18:38]--[2025-09-04 Do 21:41] =>  3:03
    CLOCK: [2025-07-30 Mi 17:37]--[2025-07-30 Mi 17:37] =>  0:00
    CLOCK: [2025-07-12 Sa 17:13]--[2025-07-12 Sa 18:10] =>  0:57
    CLOCK: [2025-07-11 Fr 15:19]--[2025-07-11 Fr 17:21] =>  2:02
    CLOCK: [2025-07-10 Do 15:20]--[2025-07-10 Do 16:27] =>  1:07
    CLOCK: [2025-07-09 Mi 14:02]--[2025-07-09 Mi 14:27] =>  0:25
    CLOCK: [2025-07-08 Di 20:00]--[2025-07-08 Di 22:30] =>  2:30
    CLOCK: [2025-07-08 Di 14:37]--[2025-07-08 Di 15:33] =>  0:56
    CLOCK: [2025-07-08 Di 11:51]--[2025-07-08 Di 11:57] =>  0:06
    :END:
    I should look into https://github.com/korylprince/ipnetgen to enumerate or
    iterate over all addresses in a network.
**** DONE Add a way to scan a specific network
     CLOSED: [2025-07-30 Mi 18:30]
     :LOGBOOK:
     CLOCK: [2025-07-30 Mi 17:37]--[2025-07-30 Mi 18:30] =>  0:53
     :END:
     I think I might need to rewrite the public interface of the Scanner.
**** DONE Make progress of scan more visible
     CLOSED: [2025-07-12 Sa 20:02]
     :LOGBOOK:
     CLOCK: [2025-07-12 Sa 18:34]--[2025-07-12 Sa 20:02] =>  1:28
     :END:
**** DONE Make number of workers configurable
     CLOSED: [2025-07-12 Sa 18:34]
     :LOGBOOK:
     CLOCK: [2025-07-12 Sa 18:10]--[2025-07-12 Sa 18:34] =>  0:24
     :END:
**** DONE Detect new devices?
     CLOSED: [2025-08-18 Mo 19:41]
     :LOGBOOK:
     CLOCK: [2025-08-18 Mo 17:58]--[2025-08-18 Mo 19:41] =>  1:43
     CLOCK: [2025-08-16 Sa 22:12]--[2025-08-16 Sa 22:29] =>  0:17
     :END:
     I am under the impression that we currently do not detect devices that
     are newly added to a network after its initial scan.
     ...
     ...
     *big facepalm time here* -- The problem was that I had forgotten to
     /start/ the Scanner from the Scheduler. So the Scheduler would send these
     commands, but with the Scanner inert, nothing happened. 🤦
*** Probe [9/13]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-08-05 Di 17:05]--[2025-08-05 Di 17:35] =>  0:30
    CLOCK: [2025-08-05 Di 14:25]--[2025-08-05 Di 15:33] =>  1:08
    CLOCK: [2025-07-26 Sa 16:22]--[2025-07-26 Sa 16:41] =>  0:19
    CLOCK: [2025-07-23 Mi 21:46]--[2025-07-23 Mi 22:48] =>  1:02
    CLOCK: [2025-07-23 Mi 19:47]--[2025-07-23 Mi 20:53] =>  1:06
    CLOCK: [2025-07-22 Di 17:22]--[2025-07-22 Di 20:23] =>  3:01
    CLOCK: [2025-07-22 Di 14:23]--[2025-07-22 Di 15:35] =>  1:12
    CLOCK: [2025-07-21 Mo 15:40]--[2025-07-21 Mo 17:54] =>  2:14
    :END:
**** Implement commands [7/10]
     :PROPERTIES:
     :COOKIE_DATA: todo recursive
     :VISIBILITY: children
     :END:
***** DONE Available updates [6/6]
      CLOSED: [2025-09-04 Do 18:14]
      :PROPERTIES:
      :COOKIE_DATA: todo recursive
      :VISIBILITY: children
      :END:
      :LOGBOOK:
      CLOCK: [2025-08-08 Fr 19:19]--[2025-08-08 Fr 20:25] =>  1:06
      CLOCK: [2025-08-06 Mi 18:20]--[2025-08-06 Mi 18:56] =>  0:36
      CLOCK: [2025-08-06 Mi 17:21]--[2025-08-06 Mi 17:28] =>  0:07
      CLOCK: [2025-08-05 Di 18:53]--[2025-08-05 Di 19:05] =>  0:12
      CLOCK: [2025-08-05 Di 18:09]--[2025-08-05 Di 18:51] =>  0:42
      :END:
      Querying for available updates can be rather time-consuming, I should
      introduce a separate interval for this.
****** DONE Debian
       CLOSED: [2025-09-02 Di 15:33]
       :LOGBOOK:
       CLOCK: [2025-08-20 Mi 17:49]--[2025-08-20 Mi 18:07] =>  0:18
       :END:
****** DONE openSUSE
       CLOSED: [2025-09-02 Di 15:33]
       :LOGBOOK:
       CLOCK: [2025-08-20 Mi 18:16]--[2025-08-20 Mi 19:09] =>  0:53
       :END:
****** DONE Fedora
       CLOSED: [2025-09-02 Di 15:34]
****** DONE FreeBSD
       CLOSED: [2025-09-04 Do 18:12]
       :LOGBOOK:
       CLOCK: [2025-09-04 Do 17:43]--[2025-09-04 Do 18:12] =>  0:29
       :END:
****** DONE OpenBSD
       CLOSED: [2025-09-02 Di 15:30]
       :LOGBOOK:
       CLOCK: [2025-09-02 Di 15:11]--[2025-09-02 Di 15:30] =>  0:19
       :END:
****** DONE Arch
       CLOSED: [2025-09-02 Di 15:34]
       :LOGBOOK:
       CLOCK: [2025-08-29 Fr 18:35]--[2025-08-29 Fr 19:24] =>  0:49
       :END:
       *Caveat* - this requires the package pacman-contrib to be installed.
***** TODO Free disk space
***** MEDITATE Temperature?
***** MEDITATE Needs reboot?
**** DONE Connect via SSH
     CLOSED: [2025-07-22 Di 18:12]
     If possible with public key authentication.
**** DONE Query OS
     CLOSED: [2025-07-22 Di 18:12]
*** Scheduler [1/1]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-08-16 Sa 19:30]--[2025-08-16 Sa 20:06] =>  0:36
    CLOCK: [2025-08-01 Fr 16:30]--[2025-08-02 Sa 15:57] => 23:27
    CLOCK: [2025-08-01 Fr 15:53]--[2025-08-01 Fr 16:17] =>  0:24
    CLOCK: [2025-07-31 Do 17:47]--[2025-07-31 Do 17:51] =>  0:04
    CLOCK: [2025-07-30 Mi 17:36]--[2025-07-30 Mi 17:37] =>  0:01
    CLOCK: [2025-07-26 Sa 16:41]--[2025-07-26 Sa 18:10] =>  1:29
    CLOCK: [2025-07-26 Sa 16:21]--[2025-07-26 Sa 16:22] =>  0:01
    CLOCK: [2025-07-24 Do 17:29]--[2025-07-25 Fr 23:23] => 29:54
    :END:
    I have been doing this wrong. The scheduler doesn't receive commands, it
    emits commands, if anything.
**** DONE Ping Device before probing
     CLOSED: [2025-08-20 Mi 17:25]
     :LOGBOOK:
     CLOCK: [2025-08-20 Mi 16:50]--[2025-08-20 Mi 17:25] =>  0:35
     CLOCK: [2025-08-19 Di 18:03]--[2025-08-19 Di 19:45] =>  1:42
     :END:
*** Settings [2/2]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-07-31 Do 17:51]--[2025-07-31 Do 18:31] =>  0:40
    :END:
**** DONE Integrate Settings into other packages
     CLOSED: [2025-08-01 Fr 15:45]
     :LOGBOOK:
     CLOCK: [2025-08-01 Fr 15:10]--[2025-08-01 Fr 15:45] =>  0:35
     CLOCK: [2025-07-31 Do 19:03]--[2025-07-31 Do 19:25] =>  0:22
     :END:
***** DONE Interval for querying pending updates
      CLOSED: [2025-08-07 Do 20:50]
      :LOGBOOK:
      CLOCK: [2025-08-07 Do 16:53]--[2025-08-07 Do 20:50] =>  3:57
      :END:
*** Web UI [4/4]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-08-29 Fr 19:35]--[2025-08-29 Fr 21:33] =>  1:58
    CLOCK: [2025-07-18 Fr 09:45]--[2025-07-18 Fr 10:40] =>  0:55
    CLOCK: [2025-07-17 Do 10:51]--[2025-07-17 Do 11:09] =>  0:18
    CLOCK: [2025-07-16 Mi 15:55]--[2025-07-16 Mi 16:50] =>  0:55
    CLOCK: [2025-07-15 Di 18:05]--[2025-07-15 Di 19:38] =>  1:33
    CLOCK: [2025-07-15 Di 17:12]--[2025-07-15 Di 17:43] =>  0:31
    CLOCK: [2025-07-14 Mo 17:32]--[2025-07-14 Mo 17:50] =>  0:18
    CLOCK: [2025-07-14 Mo 16:25]--[2025-07-14 Mo 17:04] =>  0:39
    CLOCK: [2025-07-14 Mo 14:26]--[2025-07-14 Mo 16:18] =>  1:52
    :END:
**** DONE Display more activity in web interface
     CLOSED: [2025-09-05 Fr 19:09]
     :LOGBOOK:
     CLOCK: [2025-09-05 Fr 17:47]--[2025-09-05 Fr 19:09] =>  1:22
     :END:
**** Add summary to <details>
     :LOGBOOK:
     CLOCK: [2025-08-20 Mi 18:07]--[2025-08-20 Mi 18:08] =>  0:01
     :END:
**** DONE Highlight Devices that are online
     CLOSED: [2025-08-20 Mi 17:27]
     :LOGBOOK:
     CLOCK: [2025-08-09 Sa 16:29]--[2025-08-09 Sa 17:15] =>  0:46
     :END:
**** DONE Present sysload info and updates in UI
     CLOSED: [2025-08-08 Fr 19:07]
     :LOGBOOK:
     CLOCK: [2025-08-08 Fr 18:21]--[2025-08-08 Fr 19:07] =>  0:46
     :END:
**** DONE Display pending updates
     CLOSED: [2025-08-29 Fr 18:26]
     :LOGBOOK:
     CLOCK: [2025-08-29 Fr 17:55]--[2025-08-29 Fr 18:26] =>  0:31
     CLOCK: [2025-08-26 Di 14:35]--[2025-08-26 Di 15:26] =>  0:51
     :END:
** Features [0/0]
** Bugs [1/1]
*** DONE Make scanner skip broadcast address in IPv4 networks
    CLOSED: [2025-09-04 Do 19:53]
    :LOGBOOK:
    CLOCK: [2025-09-03 Mi 18:33]--[2025-09-03 Mi 19:25] =>  0:52
    :END:

